In [1]:
import pandas as pd
import numpy as np

data = pd.read_csv('bengaluru_house_prices.csv')
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [2]:
data.shape

(13320, 9)

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [4]:
for column in data.columns:
    print(data[column].value_counts())
    print("*" * 20)

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
********************
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Oct               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
********************
location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64
********************
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64
********************
society
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
SNadeAr     1
DSellil     1
Shensit     1
VKvenas     1
Vemes H     1
Name: count, Length: 2688, dtype: int64
********************
total_sqft
1200           843
1100           221
1500           205
2400           196
600            180
              ...
2920             1
5665.84          1
1369             1
7150             1
1200 - 1470      1
Name: count, Length: 2117, dtype: int64
********************
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
27.0       1
14.0       1
40.0       1
15.0       1
18.0       1
Name: count, dtype: int64
********************
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
********************
price
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
43.04      1
61.11      1
46.56      1
42.54      1
47.35      1
Name: count, Length: 1994, dtype: int64
********************

In [5]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [6]:
data.drop(columns=['area_type', 'society', 'balcony'], inplace=True)

In [7]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   availability  13320 non-null  object
 1   location      13319 non-null  object
 2   size          13304 non-null  object
 3   total_sqft    13320 non-null  object
 4   bath          13247 non-null  float64
 5   price         13320 non-null  float64
dtypes: float64(2), object(4)
memory usage: 624.5+ KB

In [9]:
data['location'].value_counts()

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

In [10]:
data['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [11]:
data['location']=data['location'].fillna('Sarjapur Road')

In [12]:
data['bath']=data['bath'].fillna(data['bath'].median())
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   availability  13320 non-null  object
 1   location      13320 non-null  object
 2   size          13304 non-null  object
 3   total_sqft    13320 non-null  object
 4   bath          13320 non-null  float64
 5   price         13320 non-null  float64
dtypes: float64(2), object(4)
memory usage: 624.5+ KB

In [13]:
# Remove NaN values from 'size'
data = data.dropna(subset=['size'])

# Extract the first number before 'BHK'
data['bhk'] = data['size'].str.split().str.get(0)

# Convert to numeric safely (non-numeric → NaN)
data['bhk'] = pd.to_numeric(data['bhk'], errors='coerce')

# Drop rows where bhk is NaN
data = data.dropna(subset=['bhk'])

# Convert to integer finally
data['bhk'] = data['bhk'].astype(int)

# Now check if any unrealistic values exist
print(data[data['bhk'] > 20])

       availability                   location        size total_sqft  bath  \
1718  Ready To Move  2Electronic City Phase II      27 BHK       8000  27.0
4684  Ready To Move                Munnekollal  43 Bedroom       2400  40.0

      price  bhk
1718  230.0   27
4684  660.0   43

In [14]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [15]:
def convertRange(x):
    try:
        # Case 1: If value is a range like '2100 - 2850'
        if '-' in str(x):
            temp = x.split('-')
            return (float(temp[0].strip()) + float(temp[1].strip())) / 2
        
        # Case 2: If value is just a number like '547.34' or '1200'
        return float(str(x).strip())
    
    except:
        return None
    
data['total_sqft'] = data['total_sqft'].apply(convertRange)
data = data.dropna(subset=['total_sqft'])  # drop rows where conversion failed

data.head(10)   # Shows first 10 rows with all columns

,availability,location,size,total_sqft,bath,price,bhk
0,19-Dec,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2
1,Ready To Move,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4
2,Ready To Move,Uttarahalli,3 BHK,1440.0,2.0,62.00,3
3,Ready To Move,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3
4,Ready To Move,Kothanur,2 BHK,1200.0,2.0,51.00,2
5,Ready To Move,Whitefield,2 BHK,1170.0,2.0,38.00,2
6,18-May,Old Airport Road,4 BHK,2732.0,4.0,204.00,4
7,Ready To Move,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4
8,Ready To Move,Marathahalli,3 BHK,1310.0,3.0,63.25,3
9,Ready To Move,Gandhi Bazar,6 Bedroom,1020.0,6.0,370.00,6

In [16]:
#######  PRICE PER SQUARE FEET
data['price_per_sqft'] = data['price'] * 100000 / data['total_sqft']

In [17]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13258, dtype: float64

In [18]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13258.000000  13258.000000  13258.000000  13258.000000    1.325800e+04
mean    1558.812282      2.688188    112.469985      2.802685    7.912634e+03
std     1238.432276      1.336751    149.087270      1.292070    1.064936e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.271229e+03
50%     1275.000000      2.000000     72.000000      3.000000    5.438331e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.313266e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [19]:
data['location'].value_counts()

location
Whitefield                         537
Sarjapur  Road                     397
Electronic City                    302
Kanakpura Road                     271
Thanisandra                        233
                                  ...
Devarabeesana Halli                  1
beml layout, basaveshwara nagar      1
Sadhguru Layout                      1
Chikbasavanapura                     1
Electronic City Phase 1,             1
Name: count, Length: 1299, dtype: int64

In [20]:
data['location'] = data['location'].apply(lambda x: x.strip())  
location_count=data['location'].value_counts()

In [21]:
location_count_less_10=location_count[location_count<=10]
location_count_less_10

location
Gunjur Palya         10
Dodsworth Layout     10
Thyagaraja Nagar     10
Nagadevanahalli      10
Naganathapura        10
                     ..
Chikkanahalli         1
Halanayakanahalli     1
Park View Layout      1
Xavier Layout         1
Air View Colony       1
Name: count, Length: 1048, dtype: int64

In [22]:
data['loction']=data['location'].apply(lambda x: 'other' if x in location_count_less_10 else x) 
data['location'].value_counts()

location
Whitefield           538
Sarjapur  Road       397
Electronic City      304
Kanakpura Road       271
Thanisandra          236
                    ...
Chikkanahalli          1
Halanayakanahalli      1
Park View Layout       1
Xavier Layout          1
Air View Colony        1
Name: count, Length: 1288, dtype: int64

In [23]:
#### OUTLIER DETECTION AND REMOVAL
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13258.000000  13258.000000  13258.000000  13258.000000    1.325800e+04
mean    1558.812282      2.688188    112.469985      2.802685    7.912634e+03
std     1238.432276      1.336751    149.087270      1.292070    1.064936e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.271229e+03
50%     1275.000000      2.000000     72.000000      3.000000    5.438331e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.313266e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [24]:
(data['total_sqft']/data['bhk']).describe()

count    13258.000000
mean       574.420590
std        387.584212
min          0.250000
25%        473.333333
50%        552.250000
75%        625.000000
max      26136.000000
dtype: float64

In [25]:
data=data[((data['total_sqft']/data['bhk'])>=300)]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12514.000000  12514.000000  12514.000000  12514.000000    12514.000000
mean    1593.746383      2.560253    111.398333      2.651670     6307.367132
std     1261.351669      1.078441    152.098807      0.977025     4160.773691
min      300.000000      1.000000      9.000000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.762120
50%     1300.000000      2.000000     70.000000      3.000000     5295.073227
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [26]:
data.shape

(12514, 9)

In [27]:
data.price_per_sqft.describe()

count     12514.000000
mean       6307.367132
std        4160.773691
min         267.829813
25%        4210.762120
50%        5295.073227
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [28]:
def remove_outliners_sqft(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf['price_per_sqft'])
        st = np.std(subdf['price_per_sqft'])
        reduced_df = subdf[(subdf['price_per_sqft']>(m-st)) & (subdf['price_per_sqft']<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
data=remove_outliners_sqft(data)
data.describe

<bound method NDFrame.describe of        availability               location       size  total_sqft  bath  \
0     Ready To Move   1st Block BEL Layout      3 BHK      1540.0   3.0
1     Ready To Move   1st Block HBR Layout      1 BHK       600.0   1.0
2     Ready To Move   1st Block HBR Layout      4 BHK      3150.0   4.0
3     Ready To Move  1st Block HRBR Layout      3 BHK      2300.0   3.0
4     Ready To Move  1st Block HRBR Layout      2 BHK      1250.0   2.0
...             ...                    ...        ...         ...   ...
9306         18-Nov           manyata park      3 BHK      1780.0   3.0
9307  Ready To Move                  south  3 Bedroom      2400.0   2.0
9308  Ready To Move               tc.palya  2 Bedroom       880.0   2.0
9309         18-Apr               tc.palya  2 Bedroom      1000.0   2.0
9310         18-Apr               tc.palya  3 Bedroom      1400.0   2.0

       price  bhk  price_per_sqft loction
0      85.00    3     5519.480519   other
1      45.00    1     7500.000000   other
2     150.00    4     4761.904762   other
3      80.00    3     3478.260870   other
4      67.00    2     5360.000000   other
...      ...  ...             ...     ...
9306   84.83    3     4765.730337   other
9307  480.00    3    20000.000000   other
9308   48.00    2     5454.545455   other
9309   55.00    2     5500.000000   other
9310   78.00    3     5571.428571   other

[9311 rows x 9 columns]>

In [29]:
def bhk_outlier_remover(df):
    excludes_indices=np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats={}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]={
                'mean':np.mean(bhk_df['price_per_sqft']),
                'std':np.std(bhk_df['price_per_sqft']),
                'count':bhk_df.shape[0]
            }
            
            
        for bhk, bhk_df in location_df.groupby('bhk'):
           stats=bhk_stats.get(bhk-1)
        if stats and stats['count']>5:
                excludes_indices=np.append(excludes_indices,bhk_df[bhk_df['price_per_sqft']<(stats['mean'])].index.values)
    return df.drop(excludes_indices,axis='index')

In [30]:
data=bhk_outlier_remover(data)

In [31]:
data.shape

(9057, 9)

In [32]:
data

,availability,location,size,total_sqft,bath,price,bhk,price_per_sqft,loction
0,Ready To Move,1st Block BEL Layout,3 BHK,1540.0,3.0,85.00,3,5519.480519,other
1,Ready To Move,1st Block HBR Layout,1 BHK,600.0,1.0,45.00,1,7500.000000,other
2,Ready To Move,1st Block HBR Layout,4 BHK,3150.0,4.0,150.00,4,4761.904762,other
3,Ready To Move,1st Block HRBR Layout,3 BHK,2300.0,3.0,80.00,3,3478.260870,other
4,Ready To Move,1st Block HRBR Layout,2 BHK,1250.0,2.0,67.00,2,5360.000000,other
...,...,...,...,...,...,...,...,...,...
9306,18-Nov,manyata park,3 BHK,1780.0,3.0,84.83,3,4765.730337,other
9307,Ready To Move,south,3 Bedroom,2400.0,2.0,480.00,3,20000.000000,other
9308,Ready To Move,tc.palya,2 Bedroom,880.0,2.0,48.00,2,5454.545455,other
9309,18-Apr,tc.palya,2 Bedroom,1000.0,2.0,55.00,2,5500.000000,other
9310,18-Apr,tc.palya,3 Bedroom,1400.0,2.0,78.00,3,5571.428571,other

In [33]:
data.drop(columns=['size','price_per_sqft'],inplace=True)

CLEANED DATA

In [34]:
data.head()

    availability               location  total_sqft  bath  price  bhk loction
0  Ready To Move   1st Block BEL Layout      1540.0   3.0   85.0    3   other
1  Ready To Move   1st Block HBR Layout       600.0   1.0   45.0    1   other
2  Ready To Move   1st Block HBR Layout      3150.0   4.0  150.0    4   other
3  Ready To Move  1st Block HRBR Layout      2300.0   3.0   80.0    3   other
4  Ready To Move  1st Block HRBR Layout      1250.0   2.0   67.0    2   other

In [35]:
data.to_csv("cleaned_data.csv")

In [36]:
X=data.drop(columns=['price'])
y=data['price']

In [37]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [38]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

In [39]:
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(7245, 6) (1812, 6) (7245,) (1812,)

APPLYING LINEAR REGRESSION

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

# ✅ Create price_per_sqft column if not present
if "price_per_sqft" not in data.columns:
    data['price_per_sqft'] = (data['price'] * 100000) / data['total_sqft']

# Features and target
X = data.drop(['price'], axis=1)
y = data['price']

# Explicit column lists
categorical_cols = ['location', 'availability']   # adjust if dataset differs
numeric_cols = ['total_sqft', 'bhk', 'bath', 'price_per_sqft']

# Preprocessor
preprocessor = ColumnTransformer(
    transformers=[
        ('num', StandardScaler(), numeric_cols),
        ('cat', OneHotEncoder(handle_unknown='ignore'), categorical_cols)
    ]
)

# Pipeline
pipe = Pipeline([
    ('preprocessor', preprocessor),
    ('model', LinearRegression())
])

# Train-test split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Fit
pipe.fit(X_train, y_train)

print("Train Score:", pipe.score(X_train, y_train))
print("Test Score:", pipe.score(X_test, y_test))

Train Score: 0.9187925125190933
Test Score: 0.8416077532734746

In [41]:
print(data.columns)

Index(['availability', 'location', 'total_sqft', 'bath', 'price', 'bhk',
       'loction', 'price_per_sqft'],
      dtype='object')

APPLYING LASSO

In [42]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import Lasso
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score


X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
categorical_cols = X.select_dtypes(include=['object']).columns.tolist()
numeric_cols = X.select_dtypes(exclude=['object']).columns.tolist()

print("Categorical columns:", categorical_cols)
print("Numeric columns:", numeric_cols)

column_trans = ColumnTransformer(
    transformers=[
        ('cat', OneHotEncoder(sparse_output=False, handle_unknown='ignore'), categorical_cols),
        ('num', StandardScaler(), numeric_cols)
    ]
)

# Model
lasso = Lasso(alpha=0.1)

# Build pipeline
pipe = make_pipeline(column_trans, lasso)

Categorical columns: ['availability', 'location', 'loction']
Numeric columns: ['total_sqft', 'bath', 'bhk', 'price_per_sqft']

In [43]:
pipe.fit(X_train, y_train)   
y_pred_lasso = pipe.predict(X_test)
r2_score(y_test, y_pred_lasso)

0.8398637696538038

In [44]:
from sklearn.linear_model import Ridge
from sklearn.pipeline import make_pipeline
from sklearn.compose import ColumnTransformer
ridge=Ridge(alpha=1.0)
pipe=make_pipeline(column_trans, ridge)
pipe.fit(X_train, y_train)
y_pred_ridge=pipe.predict(X_test)

In [45]:
y_pred_ridge=pipe.predict(X_test)
r2_score(y_test, y_pred_ridge)

0.8461421170155473

In [46]:
y_pred_ridge = pipe.predict(X_test)
print("Ridge R² Score:", r2_score(y_test, y_pred_ridge))
print("Lasso R² Score:", r2_score(y_test, y_pred_lasso))
print("Ridge R² Score:", r2_score(y_test, y_pred_ridge))

Ridge R² Score: 0.8461421170155473
Lasso R² Score: 0.8398637696538038
Ridge R² Score: 0.8461421170155473

In [47]:
import joblib

# After training your pipeline `pipe`
joblib.dump(pipe, "RidgeModel.pkl")
print("✅ Model saved using joblib")

✅ Model saved using joblib